# coding=gbk
import json
import re


def splitSentence(text):
    pattern = r'。|！|？|；|='
    result_list = re.split(pattern, text)
    result_list = list(filter(not_empty, result_list))
    #    print(result_list)
    return result_list

def not_empty(s):
        return s and "".join(s.split())

def occurrence(sentence_list, entity1, entity2):
    result_list = []
    for sentence in sentence_list:
        if entity1 in sentence and entity2 in sentence:
            result_list.append(sentence)
    return result_list


if __name__ == "__main__":
    place = []
    fileList = ['5A_颐和园.txt','5A_北京故宫博物院.txt','5A_颐和园.txt','5A_慕田峪长城.txt','5A_天坛公园.txt']
    for fileName in fileList:
        f = open('D:\python-file\北京市旅游知识图谱\\verb-entity\\bj_travel\\' + fileName
                 , 'r', encoding='utf-8')
        file = f.read()
        #    print(file)
        json_file = json.loads(file)  # 转化为json格式
        text = json_file.get("text")  # 读取text

        sentence_list = splitSentence(text)  # 将text分为句子列表

        # print(sentence_list)
        # print(len(sentence_list))
        # entity1 = "乾清宫"
        # entity2 = "位于"
        entity1 = "位于"
        entity2 = "位于"
        resultList = occurrence(sentence_list, entity1, entity2)
        for result in resultList:
            print(result)
    # outputDict = dict()
    # person=["军机大臣", "吴彬", "卢永祥", "鞍马", "红楼梦", "程君房", "九龙壁", "内竖", "李白", "天井", "黄公望", "周恩来", "慈宁宫", "箕子", "沈阳", "张南", "周朗", "朱棣", "庆王", "丰绅殷德", "黄玉", "藏锋", "江泽民", "于文华", "垂花门", "王珣", "薛笃弼", "斋戒", "吴琚", "吴伟", "夏昶", "曹全", "蒯祥", "蓬莱", "幼儿园", "董事会", "杨茂", "大都会", "明星", "元", "水墨", "杨维桢", "惠子", "阿睦尔撒纳", "帝国主义", "褚遂良", "储秀宫", "汤和", "手下留情", "玫瑰", "总书记", "张学良", "顾安", "神仙", "王名", "太常寺卿", "张逊", "石狮", "善本", "李煜", "朱德润", "李广", "驴友", "明", "战国", "计算机网络", "李铁映", "于珍", "康熙", "三国", "王振鹏", "本尊", "北城", "隆庆", "企业家", "祭典", "郭守敬", "赵佶", "雍正", "道光", "王诜", "吴仲超", "易元吉", "金条", "管道升", "王刚", "胡若愚", "范源濂", "汉文化", "柯九思", "花蕊", "扬州", "鲜于枢", "刘源", "阎立本", "厉善麟", "毗卢帽", "出恭", "太妃", "踏歌", "王大臣", "邹家华", "赵伯骕", "任仁发", "马和之", "陆机", "张先", "土龙", "琉璃", "清朝", "冬至", "白银", "王正廷", "长城", "侯仁之", "张继", "鹿钟麟", "钟表", "宋徽宗赵佶", "张即之", "孝圣宪皇后", "李高", "红海", "李仲三", "吕纪", "王渊", "总统", "瀛洲", "陈容", "杨康", "红宝石", "昊天", "金文", "戚继光", "统治者", "古玩", "陈淳", "欧阳修", "石坊", "北京故宫", "瑞雪", "辛亥革命", "吴说", "李公麟", "颜真卿", "方于鲁", "沥粉贴金", "刘华清", "战利品", "扬州八怪", "邓文原", "道教", "周伯琦", "李建中", "成龙", "金石", "西苑", "顶礼膜拜", "金銮", "陈垣", "花梨", "皇庄", "黄庭坚", "卜商", "倪瓒", "北海", "秋江", "龙飞", "英语", "杭立武", "江山", "逊帝", "成化", "玉泉", "黄筌", "牌坊", "红龙", "康里巎巎", "帝后", "王公", "吴之璠", "董源", "接引佛", "崔子忠", "唐朝", "金朝", "蓝宝石", "张作霖", "周文矩", "王国维", "天帝", "蔡襄", "马衡", "祁序", "赵伯驹", "杜牧", "徐中", "朱熹", "永和宫", "虞世南", "无量寿佛", "神乐", "转轮藏", "方园", "贝勒", "王冕", "朱三松", "文生", "李铁", "李鸿章", "李衎", "二弟", "梅展", "孝仪纯皇后", "四分之三", "丁香", "赵芾", "方丈", "法国", "菊花", "韩熙载夜宴图", "冯承素", "藏文大藏经", "孙子", "钱选", "朱元璋", "天子", "泰山", "北京建筑工程学院", "朱碧山", "方泽", "李长春", "顾闳中", "天下第一", "荣毅仁", "荷花", "周昉", "东海", "皇后", "天心", "石拓", "张宏", "青瓷", "玉兰", "延禧宫", "久永", "仇英", "十七孔桥", "郭沫若", "样式雷", "四王", "刘松年", "赵昌", "肖俊", "端砚", "西湖", "胡博", "嘉庆", "正脊", "香火", "戴进", "擎天柱", "丘方", "伯乐", "吴恽", "苏轼", "文昌帝君", "海棠", "西周", "熊希龄", "寺院", "李岚清", "关山", "出花园", "王蒙", "金殿", "慈禧太后", "唐寅", "单霁翔", "古柏", "马麟", "喜了", "阴阳", "四大部洲", "米浆", "古典园林", "坐北朝南", "张敏", "石涛", "皇极殿", "王旭东", "菱花", "朱德润墓志铭", "中国古典园林", "比尔·盖茨", "吴镇", "竹西", "沈周", "许世英", "米友仁", "文房四宝", "刘淇", "徐渭", "教会学校", "梅杰", "张璧", "王昆仑", "祖训", "韩滉", "王羲之", "夏雨", "念念不忘", "巴图鲁", "杨凝式", "王希孟", "白玉", "薛绍彭", "清文翻译全藏经", "御前侍卫", "卷毛", "英廉", "孟春", "紫檀", "赵孟頫", "赵雍", "嘉庆皇帝", "敌台", "唐伯虎", "渡江", "黄荃", "祭品", "阎敬铭", "张择端", "南方", "米芾", "高祖", "照夜白", "甘珠尔", "末那", "李宗仁", "朱地", "洪范", "阮郜", "冬雪", "顾恺之", "展子虔", "山居图", "何朝宗", "尚书", "蝙蝠", "藏传佛教", "欧阳询", "方从义", "文彦博", "宫殿建筑", "曲直", "宗教建筑", "盆景", "赵孟坚", "长江", "爱新觉罗·溥仪", "金彩", "邀月", "梅花", "寒松", "联合国", "南京", "三大殿", "养心殿", "神道", "李湜", "郭熙", "范仲淹", "歇山顶", "黄郛", "祭祀", "漱芳斋", "杭州", "花云", "黄鹤楼", "厉子嘉", "废墟", "白菜", "林逋", "秦石", "冯玉祥", "桂花", "李嵩", "陈展", "梁士诒", "望柱", "王绎", "崔白", "道观", "炒红果", "张百发", "项圣谟", "天桥", "陈居中", "朱颜", "骨幽", "永乐", "韦偃", "南赡部洲", "李瑞环", "Muse", "段祺瑞", "清明", "宫女", "夏圭", "梁师闵", "毛笔", "永保", "保和殿", "寄畅园", "中华民族", "徐达", "宣统", "陈放", "萨满教", "谷牧", "文昌阁", "非你莫属", "陈洪绶", "文天祥", "汪大燮", "柳荫", "景阳宫", "王道", "牡丹", "扬无咎", "晨星", "教授", "宁静", "满文大藏经", "李迪", "桥本龙太郎", "陆游", "魏忠贤", "金木", "堂屋", "梁楷", "陆曜", "于右任", "溥心畲", "史晨", "法华寺", "出帝", "尘埃", "扫尘", "皇帝", "马远", "高克恭", "山中定次郎", "饮食文化", "四智", "王溥", "汪明荃", "春节", "和玺彩画", "易培基", "卫贤", "篝火", "玉龙", "广州", "四合院", "清明上河图", "李鹏", "金昭", "高宗", "盛懋", "胡瓌", "香港", "王献之", "曹知白", "乾隆", "天门", "紫微垣", "李唐"]
    # for index1 in range(0,len(person)):
    #     for index2 in range(index1+1,len(person)):
    #         print( person[index1] + "--" +  person[index2])
    #         sentenceIncluding_list = occurrence(sentence_list, person[index1], person[index2])
    #         if len(sentenceIncluding_list) != 0:
    #             outputDict[str(index1)+"--"+str(index2)] = sentenceIncluding_list
    # with open('entity_verb_result\\' + "PersonOccurrenceSentence.json", 'w',
    #           encoding='utf-8') as json_file:
    #     json_file.write(json.dumps(outputDict, ensure_ascii=False))
    # print(len(sentenceIncluding_list))
    # for sentenceIncluding in sentenceIncluding_list:
    #     print(sentenceIncluding)